/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Operasi tidak dapat diselesaikan";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Ralat tidak diketahui telah berlaku (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Tak Boleh Selesaikan Tindakan";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Cuba lagi nanti.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Tidak Boleh Rakam";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Cuba merakam lagi.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Tidak Boleh Rakam";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Hentikan aksi lain menggunakan %@ dan cuba lagi."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Tidak Boleh Rakam";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Cuba merakam lagi.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Cuba merakam lagi.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operasi Dihentikan";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Tidak cukup ruang tersedia untuk meneruskan penulisan fail. Bebaskan ruang dengan memadam video atau foto sedia ada.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Cuba merakam lagi.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Cuba merakam lagi.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Panjang maksimum untuk rakaman ini telah tercapai."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Saiz maksimum untuk rakaman ini telah tercapai."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Hentikan aksi lain menggunakan peranti rakam dan cuba lagi.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Panjang maksimum untuk rakaman ini telah tercapai."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Tidak Boleh Rakam";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Cuba merakam lagi.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Tidak Boleh Menggunakan %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Hentikan aksi lain menggunakan %@ dan cuba lagi."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Tidak Boleh Menggunakan %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Hentikan aksi lain menggunakan %@ dan cuba lagi."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Rakaman Dihentikan";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Hentikan aksi lain menggunakan peranti rakam dan cuba lagi.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Tak Boleh Selesaikan Tindakan";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Cuba lagi nanti.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Tak Boleh Selesaikan Eksport";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Cuba mengeksport lagi.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Tidak boleh Nyahkod";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Data media tidak dapat dinyahkod. Ia mungkin telah rosak.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Format media ini tidak disokong.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Tidak Boleh Simpan";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Cuba simpan lagi.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Media ini tidak boleh digunakan.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Media ini tidak boleh digunakan.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Media ini tidak boleh digunakan.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Media ini tidak boleh digunakan.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Format media ini tidak disokong.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Media ini mungkin rosak.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Tidak Boleh Mengambil Foto";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Cuba mengambil foto lagi.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operasi Dihentikan";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Operasi tidak disokong untuk kandungan yang dilindungi."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Kandungan ini tidak dibenarkan."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Aplikasi ini tidak disahkan untuk memainkan fail ini."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Media ini tidak boleh digunakan.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Tidak boleh Nyahkod";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Penyahkod yang diperlukan untuk media ini tidak boleh ditemui.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Tidak boleh Dikodkan";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Pengekod yang diperlukan untuk media ini tidak boleh ditemui.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Tidak boleh Nyahkod";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Penyahkod yang diperlukan untuk media ini sibuk.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Hentikan sebarang tindakan lain yang menyahkod media dan cuba lagi.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Tidak boleh Dikodkan";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Pengekod yang diperlukan untuk media ini sibuk.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Hentikan sebarang tindakan lain yang mengekod media dan cuba lagi.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Tidak Boleh Menggunakan %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@ tidak boleh digunakan oleh aplikasi yang berjalan di latar belakang."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operasi Dihentikan";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Operasi tidak disokong untuk media ini.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operasi Dihentikan";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Video tidak dapat digubah menurut arahan yang dibekalkan.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Tidak Boleh Buka";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Media ini tidak boleh digunakan.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operasi Dihentikan";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Fail cache di URL destinasi muat turun tidak boleh digunakan.";
